const resStatus = {
  401:"跳轉回首頁",
  10001:"密码格式有误",
  10002:"密码有误",
  10003:"验证码有误",
  10009:"用户已被禁用",
  10013:"验证码已失效",
  10014:"用户未被禁用",
  10015:"邮件发送失败",
  20004:"该用户已被封锁",// 2-联络人相關
  30005:"用户已被封禁",// 3-群組, 聊天室相關
  40002:"文件上传失败",// 4-檔案相關

  // 1-帐号相关
  10004:"该用户名或手机号码已存在",
  10005:"手机号码已存在",
  10006:"手机号码不存在",
  10007:"验证码已发送过,请一分钟后再发送",
  10008:"登录已失效,请重新登录",
  10010:"平台不存在",
  10011:"平台不存在",
  10012:"用户不存在",
  // 2-联络人相關
  20001:"无法增加自己到联络人",
  20002:"联络人已新增过",
  20003:"无法封锁自己",
  // 3-群組, 聊天室相關
  30001:"群组名不可为空",
  30002:"非管理者没有权限",
  30003:"无此聊天室",
  30004:"用户不在该聊天室",
  30006:"无此成员",
  // 4-檔案相關
  40001:"文件格式有误",
  // 5-IM相關
  50001:"重复讯息",
  50002:"需先授权",
  50003:"你已在别处建立连接，此会话关闭",
  50004:"访客没有权限执行",
  50005:"消息格式错误,请检查再传递",
  50006:"无此历史记录",
  50007:"訊息無法刪除",
  50008:"置顶已达上限",
  10019:"帳號已刪除"
}

      
export default resStatus
